Задание

Опишите ваши дальнейшие действия что бы ваш код появился в ветке master в репозитории git@example.com:example/test.git


1. Відкрити термінал;
2. команда git commit -m "назва коміту", для фіксування усіх змін (у разі якщо цього не було зроблено раніше);
3. команда git remote add origin git@example.com:example/test.git для додавання віддаленого репозиторію;
4. команда git branch -M master створення гілки майстер (якщо її не було створено замовником);
5. команда git push -u origin master, для завантаження файлів з кодом у репозиторій.