// Для створення такої функції, 
// яка дозволяє визивати її послідовно з довільною кількістю аргументів, вам потрібно використовувати замикання(closures)

function add(x: number) { // функція приймає аргумент (х) який є числом та повертає внутрішню функцію innerAdd
  let sum = x;

  function innerAdd(y:number) {// при виклику цієї функції з аргументом (у) вона додає аргумент до змінної sum та повертає саму себе 
    sum += y;
    return innerAdd;
  }

  innerAdd.valueOf = function () {// valueOf методу дозволяє використовувати об'єкт innerAdd в математичних операціях і отримувати числове представлення суми без необхідності викликати його явно
    return sum;
  };

  return innerAdd;
}